win_width, win_height = 1600, 900
win_title = 'Smart PhotoSwitcher'
img_ext = ['.jpg', '.jpeg', '.png', '.gif', '.bmp', '.tiff']
video_ext = [
    '.3g2', '.3gp', '.3gp2', '.3gpp', '.3gpp2', '.asf', '.asx', '.avi',
    '.bin', '.dat', '.drv', '.f4v', '.flv', '.gtp', '.h264', '.m4v', '.mkv',
    '.mod', '.moov', '.mov', '.mp4', '.mpeg', '.mpg', '.mts', '.rm', '.rmvb',
    '.spl', '.srt', '.stl', '.swf', '.ts', '.vcd', '.vid', '.vid', '.vid',
    '.vob', '.webm', '.wm', '.wmv', '.yuv']
ignor_ext = [".db"]
cur_lang = "ru"
lang1 = {
    "lb_main": {
        "ru": "Программа сортировки файлов по дате (/Год/Месяц/Старая папка)",
        "en": ""},
    "lb_image": {
        "ru": "Выберите файл для просмотра",
        "en": ""},
    "lb_from": {
        "ru": "Источник:",
        "en": ""},
    "btn_from": {
        "ru": "Выбор папки",
        "en": ""},
    "lb_to": {
        "ru": "Результат:",
        "en": ""},
    "btn_to": {
        "ru": "Выбор папки",
        "en": ""},
    "lb_dirs": {
        "ru": "Список папок",
        "en": ""},
    "lb_files": {
        "ru": "Список файлов",
        "en": ""},
    "lb_ext": {
        "ru": "Выберите типы файлов",
        "en": ""},
    "lb_filesize": {
        "ru": 'Размер файла:           ',
        "en": ""},
    "lb_ratio": {
        "ru": 'Разрешение:             ',
        "en": ""},
    "lb_data": {
        "ru": "Дата и время изменения:",
        "en": ""},
    "btn_left": {
        "ru": "Лево",
        "en": ""},
    "btn_right": {
        "ru": "Право",
        "en": ""},
    "btn_flip": {
        "ru": "Зеркало",
        "en": ""},
    "btn_disable": {
        "ru": "Убрать из списка",
        "en": ""},
    "btn_del": {
        "ru": "Удалить с диска",
        "en": ""},
    "rbtn_copy_to": {
        "ru": 'Копировать в другую папку',
        "en": ""},
    "rbtn_move_to": {
        "ru": 'Переместить в другую папку',
        "en": ""},
    "rbtn_move": {
        "ru": 'Сортировать в исходной папке (без копирования)',
        "en": ""},
    "rbtn_1": {
        "ru": 'Вместе с фото',
        "en": ""},
    "rbtn_2": {
        "ru": 'Разделить на подпапки',
        "en": ""},
    "rbtn_3": {
        "ru": 'Разделить на Фото и Видео',
        "en": ""},
    "btn_run": {
        "ru": "Выполнить",
        "en": ""}
}
lang2 = {
    "path_holder": {
        "ru": "Введите путь или нажмите выбрать",
        "en": ""},
    "lb_info": {
        "ru": "Выбрано {} файлов",
        "en": "{}"},
    "file_info": {
        "ru": "Информация о файле:",
        "en": ""},
    "gb_mode": {
        "ru": "Выберите режим обработки файлов:",
        "en": ""},
    "gb_video": {
        "ru": "Обработка видео файлов:",
        "en": ""},
    "msg": {
        "ru": "Уведомление",
        "en": ""},
    "msg_path": {
        "ru": "Указан неверный путь! Введите полный путь к папке.",
        "en": ""},
    "copy": {
        "ru": "Копирование файлов",
        "en": ""},
    "move": {
        "ru": "Перемещение файлов",
        "en": ""}
}
