win_width, win_height = 1600, 900
win_title = 'Smart PhotoSwitcher'
img_ext = ['.jpg', '.jpeg', '.png', '.gif', '.bmp']
ignor_ext = [".db"]
cur_lang = "ru"
lang1 = {
    "lb_image": {
        "ru": "Выберите файл для просмотра",
        "en": ""},
    "lb_from": {
        "ru": "Источник:",
        "en": ""},
    "btn_from": {
        "ru": "Выбор папки",
        "en": ""},
    "lb_to": {
        "ru": "Результат:",
        "en": ""},
    "btn_to": {
        "ru": "Выбор папки",
        "en": ""},
    "lb_dirs": {
        "ru": "Список папок",
        "en": ""},
    "lb_files": {
        "ru": "Список файлов",
        "en": ""},
    "lb_ext": {
        "ru": "Выберите типы файлов",
        "en": ""},
    "lb_filesize": {
        "ru": 'Размер файла:           ',
        "en": ""},
    "lb_ratio": {
        "ru": 'Разрешение:             ',
        "en": ""},
    "lb_data": {
        "ru": "Дата и время изменения:",
        "en": ""},
    "btn_left": {
        "ru": "Лево",
        "en": ""},
    "btn_right": {
        "ru": "Право",
        "en": ""},
    "btn_flip": {
        "ru": "Зеркало",
        "en": ""},
    "btn_save": {
        "ru": "Применить",
        "en": ""},
    "check_copy": {
        "ru": 'Сортировать в исходной папке (без копирования)',
        "en": ""},
    "rbtn_1": {
        "ru": 'Вместе с фото',
        "en": ""},
    "rbtn_2": {
        "ru": 'Вместе, но в отдельных папках',
        "en": ""},
    "rbtn_3": {
        "ru": 'Отсортировать отдельно',
        "en": ""},
    "btn_run": {
        "ru": "Выполнить",
        "en": ""}
}
lang2 = {
    "path_holder": {
        "ru": "Введите путь или нажмите выбрать",
        "en": ""},
    "lb_info": {
        "ru": "Выбрано {} файлов",
        "en": "{}"},
    "file_info": {
        "ru": "Информация о файле:",
        "en": ""},
    "RadioGroupBox": {
        "ru": "Обработка видео файлов:",
        "en": ""},
    "msg": {
        "ru": "Уведомление",
        "en": ""},
    "msg_path": {
        "ru": "Указан неверный путь! Введите полный путь к папке.",
        "en": ""},
    "copy": {
        "ru": "Копирование файлов",
        "en": ""},
    "move": {
        "ru": "Перемещение файлов",
        "en": ""}
}
